# Renaming Columns using Aliases
Explanation:
In SQL, you can use column aliases to rename the columns in the result set of a query. This can be useful for providing more meaningful or concise names, or for avoiding naming conflicts when joining tables.

The first example demonstrates renaming columns using column aliases. The `SELECT` statement retrieves the `first_name`, `last_name`, and `salary` columns from the `employees` table. The `AS` keyword is used to assign aliases to the columns, which are then displayed in the result set.

The second example shows how to use table aliases to rename the table in the query. The `AS` keyword is used to assign an alias (`e`) to the `employees` table. This alias can then be used to reference the columns in the table.

The third example combines column aliases and table aliases. The `AS` keyword is used to assign aliases to both the columns and the table. This allows for more concise and readable queries.

The fourth example demonstrates using column aliases with expressions. In this case, the `salary` column is multiplied by 12 to calculate the annual salary. The result is assigned an alias (`Annual Salary`) and displayed in the result set.

The fifth example shows how to use column aliases with functions. The `UPPER` function is used to convert the `first_name` column to uppercase. The result is assigned an alias (`Upper First Name`) and displayed in the result set.

Expected output:
```
First Name | Last Name | Salary
-----------|-----------|--------
John       | Doe       | 5000.00
Jane       | Smith     | 6000.00
Mike       | Johnson   | 7000.00

first_name | last_name | salary
-----------|-----------|--------
John       | Doe       | 5000.00
Jane       | Smith     | 6000.00
Mike       | Johnson   | 7000.00

First Name | Last Name | Salary
-----------|-----------|--------
John       | Doe       | 5000.00
Jane       | Smith     | 6000.00
Mike       | Johnson   | 7000.00

first_name | last_name | Annual Salary
-----------|-----------|--------------
John       | Doe       | 60000.00
Jane       | Smith     | 72000.00
Mike       | Johnson   | 84000.00

first_name | last_name | Upper First Name
-----------|-----------|-----------------
John       | Doe       | JOHN
Jane       | Smith     | JANE
Mike       | Johnson   | MIKE
```

In [ ]:
-- Creating a table
CREATE TABLE employees (
    id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    salary DECIMAL(10, 2)
);

-- Inserting sample data
INSERT INTO employees (id, first_name, last_name, salary)
VALUES (1, 'John', 'Doe', 5000),
       (2, 'Jane', 'Smith', 6000),
       (3, 'Mike', 'Johnson', 7000);

-- Querying the table with column aliases
SELECT first_name AS "First Name", last_name AS "Last Name", salary AS "Salary"
FROM employees;

-- Querying the table with table aliases
SELECT e.first_name, e.last_name, e.salary
FROM employees AS e;

-- Querying the table with column aliases and table aliases
SELECT e.first_name AS "First Name", e.last_name AS "Last Name", e.salary AS "Salary"
FROM employees AS e;

-- Querying the table with column aliases and expressions
SELECT first_name, last_name, salary * 12 AS "Annual Salary"
FROM employees;

-- Querying the table with column aliases and functions
SELECT first_name, last_name, UPPER(first_name) AS "Upper First Name"
FROM employees;

# Reordering Columns in the Output
Explanation:
In SQL, the order of columns in the output of a query is determined by the order in which they are specified in the SELECT clause. By changing the order of the columns in the SELECT clause, we can reorder the columns in the output.

In the provided code snippet, we first create a table called "employees" with columns for id, first_name, last_name, age, and salary. Then, we insert some sample data into the table.

To demonstrate reordering columns in the output, we have three SELECT queries:
1. The first query selects all columns in the original order using the asterisk (*) wildcard.
2. The second query selects columns in a different order by explicitly listing the column names in the desired order.
3. The third query selects columns with aliases, where the column names are replaced with custom labels using the AS keyword.
4. The fourth query selects columns with expressions, where an additional calculated column "Age in Months" is included in the output by multiplying the "age" column by 12.

Each query is followed by the expected output, which demonstrates the reordering of columns based on the specified SELECT clause.

Reordering columns in the output can be useful when presenting data in a different format or when specific column orders are required for downstream processing.

In [ ]:
-- Create a table
CREATE TABLE employees (
    id INT,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert some sample data
INSERT INTO employees (id, first_name, last_name, age, salary)
VALUES (1, 'John', 'Doe', 30, 50000),
       (2, 'Jane', 'Smith', 25, 60000),
       (3, 'Mike', 'Johnson', 35, 70000);

-- Query to select all columns in the original order
SELECT * FROM employees;
-- Expected output:
-- id | first_name | last_name | age | salary
-- ---+------------+-----------+-----+--------
-- 1  | John       | Doe       | 30  | 50000
-- 2  | Jane       | Smith     | 25  | 60000
-- 3  | Mike       | Johnson   | 35  | 70000

-- Query to select columns in a different order
SELECT last_name, first_name, age, salary, id FROM employees;
-- Expected output:
-- last_name | first_name | age | salary | id
-- -----------+------------+-----+--------+---
-- Doe       | John       | 30  | 50000  | 1
-- Smith     | Jane       | 25  | 60000  | 2
-- Johnson   | Mike       | 35  | 70000  | 3

-- Query to select columns with aliases
SELECT first_name AS "First Name", last_name AS "Last Name", age AS "Age", salary AS "Salary" FROM employees;
-- Expected output:
-- First Name | Last Name | Age | Salary
-- -----------+-----------+-----+--------
-- John       | Doe       | 30  | 50000
-- Jane       | Smith     | 25  | 60000
-- Mike       | Johnson   | 35  | 70000

-- Query to select columns with expressions
SELECT first_name, last_name, age, salary, age * 12 AS "Age in Months" FROM employees;
-- Expected output:
-- first_name | last_name | age | salary | Age in Months
-- -----------+-----------+-----+--------+--------------
-- John       | Doe       | 30  | 50000  | 360
-- Jane       | Smith     | 25  | 60000  | 300
-- Mike       | Johnson   | 35  | 70000  | 420

# Parsing and Manipulating Structured Data (e.g., JSON objects)
Code Explanation:

This code snippet demonstrates parsing and manipulating structured data (JSON objects) in SQL queries. Here's a breakdown of the code:

1. We create a table called `json_data` with two columns: `id` (integer) and `data` (JSON).
2. Sample JSON data is inserted into the `json_data` table.
3. The first query demonstrates how to extract specific fields (`name`, `age`, `city`) from the JSON data using the `->>` operator.
4. The second query shows how to filter the JSON data based on a specific field value (`city = 'New York'`).
5. The third query updates the `age` field in the JSON data using the `JSON_SET` function.
6. The fourth query demonstrates the updated JSON data.
7. The fifth query deletes the `city` field from the JSON data using the `JSON_REMOVE` function.
8. The sixth query demonstrates the updated JSON data.
9. The seventh query uses the `JSON_TABLE` function to extract specific fields (`name`, `age`, `city`) from the JSON data.
10. The eighth query uses the `JSON_VALUE` function to extract specific fields (`name`, `age`, `city`) from the JSON data.

The code includes comments to explain each step and the expected output is mentioned after each print statement.

In [ ]:
-- Create a table to store JSON data
CREATE TABLE json_data (
    id INT PRIMARY KEY,
    data JSON
);

-- Insert sample JSON data into the table
INSERT INTO json_data (id, data)
VALUES (1, '{"name": "John", "age": 30, "city": "New York"}'),
       (2, '{"name": "Jane", "age": 25, "city": "San Francisco"}'),
       (3, '{"name": "Bob", "age": 35, "city": "Chicago"}');

-- Query the JSON data and extract specific fields
SELECT id, data->>'name' AS name, data->>'age' AS age, data->>'city' AS city
FROM json_data;

-- Query the JSON data and filter based on a specific field value
SELECT id, data->>'name' AS name, data->>'age' AS age, data->>'city' AS city
FROM json_data
WHERE data->>'city' = 'New York';

-- Update a specific field in the JSON data
UPDATE json_data
SET data = JSON_SET(data, '$.age', '40')
WHERE id = 1;

-- Query the updated JSON data
SELECT id, data->>'name' AS name, data->>'age' AS age, data->>'city' AS city
FROM json_data
WHERE id = 1;

-- Delete a specific field from the JSON data
UPDATE json_data
SET data = JSON_REMOVE(data, '$.city')
WHERE id = 2;

-- Query the updated JSON data
SELECT id, data->>'name' AS name, data->>'age' AS age, data->>'city' AS city
FROM json_data
WHERE id = 2;

-- Query the JSON data and extract specific fields using JSON_TABLE
SELECT id, name, age, city
FROM json_data,
     JSON_TABLE(data, '$'
                COLUMNS (
                    name VARCHAR(255) PATH '$.name',
                    age INT PATH '$.age',
                    city VARCHAR(255) PATH '$.city'
                )
     ) AS jt;

-- Query the JSON data and extract specific fields using JSON_VALUE
SELECT id, JSON_VALUE(data, '$.name') AS name, JSON_VALUE(data, '$.age') AS age, JSON_VALUE(data, '$.city') AS city
FROM json_data;

# Converting Columns to Different Data Types
Explanation:
In this code snippet, we demonstrate how to convert columns to different data types in SQL queries. We start by creating a table called `my_table` with columns of various data types such as `INT`, `VARCHAR`, and `DECIMAL`. Then, we insert some sample data into the table.

Next, we convert the `age` column from `INT` to `VARCHAR` using the `ALTER TABLE` statement with the `ALTER COLUMN` clause. We specify the new data type as `VARCHAR(3)`.

After that, we convert the `salary` column from `DECIMAL` to `INTEGER` using the `ALTER TABLE` statement with the `ALTER COLUMN` clause. We use the `USING` keyword followed by the `::INTEGER` cast to perform the conversion.

Finally, we convert the `id` column from `INT` to `SERIAL`, which is an auto-incrementing data type in some SQL databases. We use the `ALTER TABLE` statement with the `ALTER COLUMN` clause and specify the new data type as `SERIAL`.

Throughout the code, we query the table after each conversion to see the changes in the column data types. The expected output is provided as comments after each `SELECT` statement.

Note: The syntax and specific data types may vary depending on the SQL database you are using.

In [ ]:
-- Create a table with columns of different data types
CREATE TABLE my_table (
    id INT,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert some sample data into the table
INSERT INTO my_table (id, name, age, salary)
VALUES (1, 'John Doe', 25, 50000.00),
       (2, 'Jane Smith', 30, 75000.00),
       (3, 'Bob Johnson', 35, 100000.00);

-- Query the table to see the original data
SELECT * FROM my_table;
-- Expected output:
-- id |    name    | age |  salary
-- ----+------------+-----+----------
--  1  | John Doe   |  25 | 50000.00
--  2  | Jane Smith |  30 | 75000.00
--  3  | Bob Johnson|  35 |100000.00

-- Convert the age column from INT to VARCHAR
ALTER TABLE my_table
ALTER COLUMN age TYPE VARCHAR(3);

-- Query the table to see the converted data
SELECT * FROM my_table;
-- Expected output:
-- id |    name    | age |  salary
-- ----+------------+-----+----------
--  1  | John Doe   |  25 | 50000.00
--  2  | Jane Smith |  30 | 75000.00
--  3  | Bob Johnson|  35 |100000.00

-- Convert the salary column from DECIMAL to INTEGER
ALTER TABLE my_table
ALTER COLUMN salary TYPE INTEGER USING salary::INTEGER;

-- Query the table to see the converted data
SELECT * FROM my_table;
-- Expected output:
-- id |    name    | age | salary
-- ----+------------+-----+--------
--  1  | John Doe   |  25 |  50000
--  2  | Jane Smith |  30 |  75000
--  3  | Bob Johnson|  35 | 100000

-- Convert the id column from INT to SERIAL (auto-incrementing)
ALTER TABLE my_table
ALTER COLUMN id TYPE SERIAL;

-- Query the table to see the converted data
SELECT * FROM my_table;
-- Expected output:
-- id |    name    | age | salary
-- ----+------------+-----+--------
--  1  | John Doe   |  25 |  50000
--  2  | Jane Smith |  30 |  75000
--  3  | Bob Johnson|  35 | 100000

-- Drop the table
DROP TABLE my_table;